---
kind: method
id: M:Autodesk.Revit.DB.BeamSystem.GetBeamIds
source: html/0f489cca-4830-9016-fe8d-d17ba4b9f4d0.htm
---
# Autodesk.Revit.DB.BeamSystem.GetBeamIds Method

Gets all the beams of the BeamSystem.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetBeamIds()
```

## Returns
The beam Ids.